--西南北区 成都府 路人16辛员外对话 峨嵋派40级任务
--author: yuanlan	
--date: 2003/5/23



function main(sel)

UTask_em = GetTask(1);

if (UTask_em == 45) then 		
	UTask_emsub03 = GetTask(31)
	if (UTask_emsub03 == 0) then 
		Say("辛员外：在下平生最喜欢结交江湖侠客，朋友们送了个外号叫“赛孟尝”，本是谬赞，可是最近有人说在下是沽名钓誉，在下心中十分不忿。不知女侠可否为在下解答几个疑惑？", 2, "请问/yes", "我还有别的事/no")
	end
	if (UTask_emsub03 == 1) then 
		Say("辛员外：女侠能否为在下解答几个疑惑？", 2, "请问/yes", "我还有别的事/no")
	end
	if (UTask_emsub03 == 3) then 
		Say("辛员外：孟尝君到底是哪国人呢？", 4, "楚国/f1", "齐国/t1", "赵国/f1", "魏国/t1")
	end
	if (UTask_emsub03 == 5) then 
		Say("辛员外：战国四公子里，除了孟尝君、信陵君和平原君以外，还有一个是谁呢？", 4, "龙阳君/f2", "靖郭君/f2", "春申君/t2", "少原君/f2")
	end	
	if (UTask_emsub03 == 10) then 
		Say("辛员外：能结交像女侠这样见识广博的朋友，是辛某的荣幸。", 0)
	end
return
end;	

Say("辛员外：在下平生最喜欢结交江湖侠客，朋友们送了个外号，叫做“赛孟尝”，实在是谬赞了。",0);

end;


function yes()
Say("辛员外：孟尝君是哪国人啊？", 4, "楚国/f1", "齐国/t1", "赵国/f1", "魏国/t1");
end;


function no()
Say("辛员外：那在下就不打扰女侠了。", 0);
SetTask(31, 1);	
end;


function t1()
Say("辛员外：哦，原来他是齐国人啊！战国四公子里，除了孟尝君、信陵君和平原君以外，你知不知道还有一个是谁呀？", 4, "龙阳君/f2", "靖郭君/f2", "春申君/t2", "少原君/f2");
end;


function f1()
Say("辛员外：好像不对吧？我上次这么说还被别人耻笑了一番。", 0);
SetTask(31, 3);	
end;


function t2()
if ( HaveItem("灵麝香囊") == 0  and  HaveItem("鹰睛护身符") == 0) then	
	Talk(4, "select", "辛员外：对呀，我怎么想不起来呢？听说当年孟尝君家中有食客三千，我虽然没有那么大的气派，但是也喜欢结交像女侠这样见识广博的朋友，女侠有什么需要我帮忙的吗？", "我眼下正在寻找灵麝香囊、鹰睛护身符和碧玺戒指。", "辛员外：干嘛不早说？我这里正好有一只碧玺戒指，女侠尽管拿去！", "多谢员外！")
end;

if ( HaveItem("灵麝香囊") == 0  and  HaveItem("鹰睛护身符") == 1 ) then	
	Talk(4, "select", "辛员外：对呀，我怎么想不起来呢？听说当年孟尝君家中有食客三千，我虽然没有那么大的气派，但是也喜欢结交像女侠这样见识广博的朋友，女侠有什么需要我帮忙的吗？", "我眼下正在寻找灵麝香囊和碧玺戒指。", "辛员外：干嘛不早说？我这里正好有一只碧玺戒指，女侠尽管拿去！", "多谢员外！")
end;

if ( HaveItem("灵麝香囊") == 1  and  HaveItem("鹰睛护身符") == 0 ) then	
	Talk(4, "select", "辛员外：对呀，我怎么想不起来呢？听说当年孟尝君家中有食客三千，我虽然没有那么大的气派，但是也喜欢结交像女侠这样见识广博的朋友，女侠有什么需要我帮忙的吗？", "我眼下正在寻找鹰睛护身符和碧玺戒指。", "辛员外：干嘛不早说？我这里正好有一只碧玺戒指，女侠尽管拿去！", "多谢员外！")
end;

if ( HaveItem("灵麝香囊") == 1  and  HaveItem("鹰睛护身符") == 1 ) then	
	Talk(4, "select", "辛员外：对呀，我怎么想不起来呢？听说当年孟尝君家中有食客三千，我虽然没有那么大的气派，但是也喜欢结交像女侠这样见识广博的朋友，女侠有什么需要我帮忙的吗？", "我眼下正在寻找碧玺戒指。", "辛员外：干嘛不早说？我这里正好有一只碧玺戒指，女侠尽管拿去！", "多谢员外！")
end;

end;


function f2()
Say("辛员外：好像不对吧？我怎么没听说过呢？", 0);
SetTask(31, 5);	
end;


function select()
AddEventItem("碧玺戒指")
Msg2Player("得到碧玺戒指。")
SetTask(31, 10)
end; 
