--description: 天忍教日月坛主非任务对话
--author: yuanlan	
--date: 2003/5/18


function trnpc03_Default()

UTask_tr = GetTask(4);

if (UTask_tr == 5) then		--接到入门任务，要直接切换到华山
Say("乌合萨：要我大名鼎鼎、玉树临风、聪明绝顶、武功天下第四的日月坛主乌合萨送你去华山？没问题，先拿三百两银子来！", 2, "麻烦你走一趟/yes3", "我还是自己走吧/no3")
return
end;


if (UTask_tr == 32) then	--接到30级任务，要直接切换到秦始皇陵
Say("乌合萨：要我大名鼎鼎、玉树临风、聪明绝顶、武功天下第四的日月坛主乌合萨送你去秦始皇陵？没问题，先拿五百两银子来！", 2, "麻烦你送我一程/yes4", "我还是自己走吧/no4")
return
end;


if (UTask_tr == 42) then	--接到40级任务，要直接切换到剑阁中原
Say("乌合萨：要我大名鼎鼎、玉树临风、聪明绝顶、武功天下第四的日月坛主乌合萨送你去剑阁？没问题，先拿七百两银子来！", 2, "麻烦你送我一程/yes5", "我还是自己走吧/no5")
return
end;


if (UTask_tr < 20) then								--尚未接20级任务
Talk(4, "", "乌合萨：你是新来的吧？知道我是谁吗？我就是大名鼎鼎、玉树临风、聪明绝顶、武功天下第四的日月坛主乌合萨！", "玩家：武功天下第四？", "乌合萨：是啊，我们教主武功天下第一，除了教主、耶律辟离和端木睿以外，我就是最厉害的啦！怎么样？你服不服气？不服气的话就让你尝尝我日月双轮的厉害！", "玩家：服气！服气！")
end;				

if (UTask_tr >= 23) and (UTask_tr < 28) then					--已经接到20级任务，尚未完成
Say("乌合萨：那小鬼就在<color=Red>东面的树林<color>里，替我好好教训他！", 0)
end;				

if (UTask_tr >= 30) and (UTask_tr < 70) then					--已经完成20级任务，尚未出师
Say("乌合萨：虽然你的武功没有我厉害，不过你能帮我夺回日月双轮，我也服气你！", 0)
end;				

if (UTask_tr >= 70) then							--已经出师
Say("乌合萨：你要走啦？我会想你的，呜呜呜……", 0)
end;				


end;


function yes3()
if (GetCash() >= 300) then
	Pay(300)
	NewWorld(2, 2288, 4091)
else
	Say("乌合萨：没有银子可请不到我大名鼎鼎、玉树临风、聪明绝顶、武功天下第四的日月坛主乌合萨！", 0)	
end;
end;

function no3()
Say("乌合萨：这么点银子也舍不得花？舍不得孩子套不着狼啊！",0)
end;


function yes4()
if (GetCash() >= 500) then
	Pay(500)
	NewWorld(7, 2235, 2847)
else
	Say("乌合萨：咱们熟归熟，没有银子可请不到我大名鼎鼎、玉树临风、聪明绝顶、武功天下第四的日月坛主乌合萨！", 0)	
end
end;

function no4()
Say("乌合萨：破财消灾听说过没有？这么点银子也舍不得花，小心命丧中途啊！",0)
end;


function yes5()
if (GetCash() >= 700) then
	Pay(700)
	NewWorld(43, 1695, 3200)
else
	Say("乌合萨：咱们熟归熟，没有银子可请不到我大名鼎鼎、玉树临风、聪明绝顶、武功天下第四的日月坛主乌合萨！", 0)	
end
end;

function no5()
Say("乌合萨：那你慢慢走吧，小心迷路，嘿嘿！",0)
end;