--description: 天忍教日月坛主20级任务
--author: yuanlan	
--date: 2003/5/18



function trnpc03_UTask_20()
Talk(8, "select1", "乌合萨：奶奶的！老子这次面子可丢大了！没脸见人啦，呜呜呜……", "玩家：发生什么事啦？", "乌合萨：我、我被人欺负啦！", "玩家：乌坛主武功了得，谁能欺负得了你？", "乌合萨：不就是一个小孩子罗！", "玩家：小孩子？！", "乌合萨：我刚才在<color=Red>东面的树林<color>里遇到一个<color=Red>小男孩<color>，那个小鬼问了一个问题，可是我怎么也想不出答案，结果就把随身兵刃<color=Red>日月双轮<color>给输掉啦！这件事情如果被教主知道，肯定得挨骂，传到江湖上也会被人耻笑，我的武功虽然高，可是也不能硬把日月双轮给抢回来，否则会被别人说是以大欺小，那以后在江湖上还怎么见人？", "玩家：到底是什么问题啊？");
DelItem("日月双轮");					--处理重接任务后，玩家捡起任务道具的情况
end;

function select1()
Say("乌合萨：有一头头朝北的牛，先向右转原地转三圈，然后向后转原地转三圈，接着再往右转，这时候它的尾巴朝哪？", 5, "朝东/no1", "朝南/no1", "朝西/no1", "朝北/no1", "朝地/yes1");
end;

function yes1()
Talk(2, "select2", "玩家：哈哈哈，这个问题太简单啦！不管那头笨牛怎么转，它的尾巴都是朝地的呀！", "乌合萨：哇！你太聪明啦！不如你去帮我教训教训那个小鬼，找他要回<color=Red>日月双轮<color>。");
end;

function no1()
Say("乌合萨：原来你也不知道啊，真是个笨蛋！", 0);
SetTask(4, 21);  
end;

function select2()
Say("乌合萨：就算我求你了，帮帮忙吧？", 2, "好吧，我试试/accept1", "我还有别的事/refuse1");
end;

function accept1()
Say("乌合萨：太好了！那小鬼就在<color=Red>东面的树林<color>里，替我好好教训他！", 0);
SetTask(4, 23);  
end;

function refuse1()
Say("乌合萨：连你都不肯帮我，我还能找谁啊，呜呜呜……", 0);
SetTask(4, 22);  
end;
