--description: 唐门耿子奇 40级任务
--author: yuanlan	
--date: 2003/3/12



function tmnpc11_UTask_42()

Task0004 = GetTaskTemp(4);
Task0005 = GetTaskTemp(5);
Task0006 = GetTaskTemp(6);
Task0007 = GetTaskTemp(7);
Task0008 = GetTaskTemp(8);

if (Task0004 == 1) and (Task0005 == 1) and (Task0006 == 1) and (Task0007 == 1) and (Task0008 == 1) then  --已经打败五只怪物
	Talk(11, "", "玩家：晚辈唐门弟子，见过耿子奇大侠！", "耿子奇：唐野是你什么人？", "玩家：是晚辈师叔。", "耿子奇：哼！他是没脸来见我，还是不敢来见我？派你这个小辈来做什么？", "玩家：前辈误会了，当年师叔不是见死不救，而是因为本门立有门规，不得为外人治病，所以他实在情非得已，这些年他也一直十分愧疚。", "耿子奇：这些缘由他为什么不亲自来向我解释？", "玩家：前辈对师叔误会甚深，恐怕一见面还等不及开口，就……", "耿子奇：其实我就是杀了他又有什么用？我妻子再也活不过来了，本来我已了无生趣，只是为了年幼的女儿才苟活至今，想不到连我唯一的女儿也得上了同样的怪病，如果连女儿也没有了，我、我活下去还有什么意思！", "玩家：前辈，你别着急，你女儿一定会有救的。", "耿子奇：能有什么办法？你师叔是天下第一的神医，他不能出手相救，还有谁能救得了我女儿？", "玩家：我自有办法，我这就去找师叔。") 
	SetTask(2, 44)
else
	Say("耿子奇：不管你是谁，有什么事先打败了我的<color=Red>五只家畜——灰狼、猛虎、金钱豹、野猪、棕熊<color>再说！", 0)
end;
	
end;







	


