--description: 唐门唐野 40级任务
--author: yuanlan	
--date: 2003/3/12



function tmnpc10_UTask_40()

Talk(4, "select", "唐野：我唐某人一生我行我素，只有一件事直到今天仍然令老夫耿耿于怀。", "老夫曾有一个莫逆之交叫<color=Red>耿子奇<color>，十年前，耿子奇的妻子得了怪病，来求我医治，但是本门早有门规，非唐门中人，一律不得医治。老夫限于门规，不论耿子奇怎么哀求，坚持不肯出手相救，结果他的妻子不久后因病去世，我二人从此反目成仇。", "前几日老夫收到了耿子奇的一封信，约老夫见面叙旧，我知道他是来找我报仇的，我欠他一条命，还给他本来也没有什么，只是老夫实在是无脸见故友啊！", "玩家：师叔，此事原怪不得你，你应该向他解释清楚原因，让他明白你当年的难处。");

end;


function select()
Say("唐野：他一心恨我见死不救，哪里听得进我的解释。", 2, "化解两人恩怨/accept", "我也无能为力/refuse");
end;


function accept()
Say("唐野：<color=Red>耿子奇<color>一直隐居在<color=Red>青城山的西部<color>。", 0);
SetTask(2, 42);
end;


function refuse()
end;






	


