--西南北区 成都府 信相寺慈海大师对话
--author: yuanlan	
--date: 2003/3/6


function main(sel)

UTask_em = GetTask(1);

if (UTask_em <10) then				--没有加入峨嵋派
Talk(4, "", "慈云法师：施主，看你是一个习武之人，来到成都，是想拜访峨眉，还是想前往蜀南竹海？", "倘若施主果真有此打算，不妨先听老衲的几句逆耳之言。", "嵋派清晓师太与本寺住持是方内知交，她为人慈和，不会难为你。但她门下的几位俗家弟子武功高强，你若要上峨嵋，必须通过她们的考验才行。", "至于蜀南竹海的唐门，老衲劝你还是不要去了。唐门中人行事诡秘、亦正亦邪，唐门四周机关重重，要想闯过竹海，恐怕凶多吉少……")
end;

if (UTask_em >= 10) then			--已经加入峨嵋派

	if (UTask_em == 45) then 		--峨嵋派40级任务
		UTask_emsub02 = GetTask(30)
		if (UTask_emsub02 == 0) then 
			Say("慈云法师：阿弥陀佛！原来是峨嵋派的女侠，贵派掌门清晓师太佛理通透，想必门下弟子佛学的造诣亦不浅，老僧不自量力，想考教考教。", 2, "请大师指点/yes", "晚辈还有别的事/no")
		end
		if (UTask_emsub02 == 1) then 
			Say("慈云法师：女侠愿意接受老僧的考教吗？", 2, "请大师指点/yes", "晚辈还有别的事/no")
		end	
		if (UTask_emsub02 == 3) then 
			Say("慈云法师：佛教是在哪朝哪代传入中土的？", 4, "战国/f1", "汉代/t1", "唐代/f1", "明代/t1")
		end
		if (UTask_emsub02 == 5) then 
			Say("慈云法师：唐朝到天竺取经的高僧是？", 4, "辩机/f2", "鉴真/f2", "一行/f2", "玄奘/t2")
		end	
		if (UTask_emsub02 == 7) then 
			Say("慈云法师：下面哪个不属于四大佛山？", 4, "普陀山/f3", "九华山/f3", "嵩山/t3", "五台山/f3")
		end
		if (UTask_emsub02 == 10) then 
			Say("慈云法师：峨嵋女侠的佛学造诣与武学造诣一样不俗，老僧佩服！", 0)
		end
	return		
	end	


	if (UTask_em == 55) then		--峨嵋派50级任务
		if ( HaveItem("金线绣像金刚经") == 1) then
			Talk(5, "", "慈云法师：阿弥陀佛！女侠有什么事吗？", "在下奉师尊之命，向贵寺送来贺礼，劳烦大师问贵寺慈海方丈通报一声。", "慈云法师：多谢尊师美意，不过贫僧也不知方丈现在何处，正在担心他的安危。", "不知发生了何事？", "慈云法师：说来奇怪，方丈今早接了一封书信后，就去了后院，直到现在也没有出来，也不知发生了什么事。")
			SetTask(1, 56)
		else
			Say("系统：真糟糕！你不小心把《金线绣像金刚经》给弄丢了，如果要完成这个任务，你必须得有《金线绣像金刚经》。", 2, "我再找找/find", "重新做这个任务/redo")
		end						
	return
	end

	if (UTask_em == 56) then
		Say("慈云法师：方丈今早接了一封书信后，就去了后院，但是到现在也没有出来，也不知发生了什么事。", 0)
		return
	end

	if (UTask_em >= 58) and (UTask_em < 70) then
		Say("慈云法师：多谢女侠救出敝寺方丈，峨嵋女侠果然名不虚传！", 0)
		return
	end

	if (UTask_em == 70) then
		Say("慈云法师：女侠日后行走江湖，有什么需要本寺帮忙的只管开口，本寺定当倾力相助。", 0)
		return
	end

	Say("慈云法师：尊师还好吗？", 0)	--加入峨嵋派后的非任务对话

end;

end;


function yes()
Say("慈云法师：佛教是在哪朝哪代传入中土的？", 4, "战国/f1", "汉代/t1", "唐代/f1", "明代/t1");
end;

function no()
Say("慈云法师：那老僧就不打扰女侠了。", 0);
SetTask(30, 1);	
end;

function t1()
Say("慈云法师：很好。女侠知道唐朝到天竺取经的高僧是谁吗？", 4, "辩机/f2", "鉴真/f2", "一行/f2", "玄奘/t2");
end;

function f1()
Say("慈云法师：阿弥陀佛！看来女侠对佛学的了解还不够深啊。", 0);
SetTask(30, 3);	
end;

function t2()
Say("慈云法师：不错，贵派所处峨眉山乃天下四大佛山之一，女侠知不知道下面哪个不属于四大佛山？", 4, "普陀山/f3", "九华山/f3", "嵩山/t3", "五台山/f3");
end;

function f2()
Say("慈云法师：女侠是不是记错了？", 0);
SetTask(30, 5);	
end;

function t3()
Talk(2, "select", "慈云法师：善哉善哉！峨嵋弟子的佛学造诣果然与武学造诣一样不俗，老僧佩服，这块鹰睛护身符送给女侠，聊表心意。", "多谢大师！");
end;

function f3()
Say("慈云法师：难道尊师没有告诉过你们吗？", 0);
SetTask(30, 7);	
end;

function select()
AddEventItem("鹰睛护身符");
Msg2Player("得到鹰睛护身符。");
SetTask(30, 10);
end; 


function find()
end;

function redo()
Say("系统：请重新回峨嵋派正殿清晓师太处接受任务。", 0)
SetTask(1, 50)	
end;