--两湖区 巴陵县 路人10沈九对话
--巴陵县新手任务：阿芳的嫁妆
--suyu
-------------------------------------------
function UTaskMain()

	Say("沈九：你要给姑娘家买嫁妆呀，我这儿的货剩的不多了，这对纯金的耳环就便宜点给您喽，只要纹银二百两",2,"买/yes","不买/no")

end;

-------------------------------------------
function Default()
	Talk(3,"", "沈九：我是从四川来的，这一路上盗匪很多，很不太平。", "可没想到自从进了洞庭湖区，就再没遇上什么强盗贼人，你说奇怪不奇怪？", "一打听，才知道原来这里真正管事的不是官府，而是一个叫做什么“天王帮”的组织，难怪能这么太平呢！");
end;

-------------------------------------------
function yes()
if(GetCash() >= 200)then
	Say("沈九：耳环已经给你包好了，货款两讫，你拿好了。",0)
	Pay(200);
	AddEventItem("耳环");
	Msg2Player("你得到一对耳环");
	SetTask(48, 2);
else
	Say("沈九：您身上的钱不够了，凑足了钱再来吧。",0)
end
	
end;

-------------------------------------------
function no()

end;

-------------------------------------------
function main()

UTask_world20 = GetTask(48);

if ((GetCamp() == 0) and (UTask_world20 == 1)) then
	UTaskMain()
else
	Default()
end;	
	
end;

-------------------------------------------