--西南北区 江津村 码头船夫对话
--suyu
--200306015

CurWharf = 2;
Include("\\Script\\Global\\station.lua");
---------------------------------------------------------------
function main(sel)

if (GetLevel() >= 10) then		--等级达到十级
	Say("船夫：要坐船去哪儿呀？", 2, "坐船/WharfFun", "不坐/OnCancel");
else		
	Say("船夫：对不起，没到十级的新手不能坐船出村。", 0)
end

end;

---------------------------------------------------------------
function  OnCancel()
   Say("船夫：没银子可哪里也去不了！",0)
end;

---------------------------------------------------------------