--西南北区 江津村 药店老板对话
--江津村新手任务：吴老爹的药
--suyu
-------------------------------------------
function UTaskMain()

	Say("药店老板：是吴老爹托你来买药的么？我早就给他准备好了，十颗川贝丸一共纹银二百两。回去跟老爷子说让他注意身体呀。",2,"买/buy","不买/no")

end;

-------------------------------------------
function Default()
	Say("药店老板：人吃五谷杂粮，谁没个头疼脑热？我这店虽小，可是绝对少不了！你要买点什么药？", 2, "交易/yes", "不交易/no");
end;

-------------------------------------------
function yes()
	Sale(24);  			--弹出交易框
end;

-------------------------------------------
function no()
end;

-------------------------------------------
function buy()

if(GetCash() >= 200)then
	Pay(200)
	AddEventItem("川贝丸") --得到药
	SetTask(49, 2)
	Msg2Player("你得到十颗川贝丸。")
else
	Say("药店老板：药我给你留着，等钱凑够了再过来取药吧。", 0)
end

end;

-------------------------------------------
function main(sel)

UTask_world21 = GetTask(49);

if ((GetCamp() == 0) and (UTask_world21 == 1)) then
	UTaskMain()
else
	Default()
end;	
	
end;

-------------------------------------------